# К сожалению, у меня не так много времени, сессия беспощадна.
# Но у меня вопрос, можно ли решить эту задачу без цикла в цикле?
# Кстати, забегая на будущее, сколько вам приходится работать? Возможна ли такая работа для
# айтишника, которую можно совмещать с универом? Типа оплачиваемой стажировки?
# Да и нет ли у вас дополнительной работы дома от основной, типа
# "домашнего задания". А то у меня такая авантюра назревает, хочу из уника свалить,
# а мама даже о моих планах не знает. Может есть такие источники, из которых можно узнать,
# как проходять будни програмера, чтоб быть готовой ко всему, так сказать. Подскажите
# пжлст, если не сложно, я даже не прошу сразу. Да и пасибо, если вы вообще дочитали досюда.

# Телега: @MrojaMur
